RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include/cyhal_adc.h
/** ADC Channel Configuration */
typedef struct
{
    /** Whether this channel should be sampled when the ADC performs a scan */
    bool enabled;
    /** Enable or disable averaging for this channel.
      * All other aspects of the averging functionality are configured in @ref cyhal_adc_config_t
      */
    bool enable_averaging;
    /** Minimum time that this channel should be sampled, in nanoseconds. The actual time may be greater
      * than this depending on hardware limitations, the sample rate, and the configuration of other channels.
      * @note While this value is specified in ns, the underlying hardware generally does not support
      * acquisition time with a granularity of 1 ns. See the implementation specific documentation for details.
      */
    uint32_t min_acquisition_ns;
} cyhal_adc_channel_config_t;

/** Handler for ADC event callbacks */
typedef void (*cyhal_adc_event_callback_t)(void *callback_arg, cyhal_adc_event_t event);

/** Initialize ADC peripheral
 *
 * The ADC will be initialized with the following default configuration:
 * - Sample rate: See implementation-specific documentation
 * - Average count: 1 (averaging disabled).
 * - Continuous scanning: false
 * - Single ended vneg: @ref CYHAL_ADC_VNEG_VREF
 * - Vref: @ref CYHAL_ADC_REF_INTERNAL
 * - External vref: @ref NC
 * - Bypassed: false
 * - Bypass pin: @ref NC
 * - Power level: @ref CYHAL_POWER_LEVEL_DEFAULT
 *
 * To change the configuration, see @ref cyhal_adc_configure
 *
 * @param[out] obj  Pointer to an ADC object. The caller must allocate the memory
 *  for this object but the init function will initialize its contents.
 * @param[in]  pin A pin corresponding to the ADC block to initialize
 *  Note: This pin is not reserved, it is just used to identify which ADC block to allocate.
 *  If multiple channels will be allocated for a single ADC instance, only one pin should be
 *  passed here; it does not matter which one. After calling this function once, call
 *  @ref cyhal_adc_channel_init_diff once for each pin whose value should be measured.
 * @param[in]  clk The clock to use can be shared, if not provided a new clock will be allocated
 * @return The status of the init request. \ref CY_RSLT_SUCCESS is returned on success.
 * On failure, a problem specific error code will be returned.
 * This error could be from the HAL or lower level driver.<br>
 * For all other return codes, please refer to device driver documentation available in the BSP landing page
 */
cy_rslt_t cyhal_adc_init(cyhal_adc_t *obj, cyhal_gpio_t pin, const cyhal_clock_t *clk);

/** Initialize the ADC peripheral and its channels using a configurator generated configuration struct
  *
 * @param[out] adc              Pointer to an adc object. The caller must allocate the memory
 *                              for this object but the init function will initialize its contents.
 * @param[out] channels         Array of pointers to ADC channel objects. This array must contain
 *                              a minimum of one (non-null) entry per channel that is enabled by the configurator
 * @param[in,out] num_channels  Length of the `channels` array. If this value is too small for all of the channels
 *                              enabled by the configurator an error will be returned. Will be updated with the
 *                              number of channels that were enabled by the configurator.
 * @param[in] cfg               Configuration structure generated by the configurator.
 * @return The status of the init request
 */
 cy_rslt_t cyhal_adc_init_cfg(cyhal_adc_t *adc, cyhal_adc_channel_t** channels, uint8_t* num_channels,
                                const cyhal_adc_configurator_t *cfg);

/** Uninitialize the ADC peripheral and cyhal_adc_t object
 *
 * @param[in,out] obj The ADC object
 */
void cyhal_adc_free(cyhal_adc_t *obj);

/** Update the ADC configuration.
  *
  * @note If a scan is in progress, this may cause it to be interrupted.
  *
  * @param[in] obj      The ADC object
  * @param[in] config   The configuration to apply
  * @return The status of the configuration request
  * On failure, a problem specific error code will be returned.
  * This error could be from the HAL or lower level driver.<br>
  * For all other return codes, please refer to device driver documentation available in the BSP landing page
  */
cy_rslt_t cyhal_adc_configure(cyhal_adc_t *obj, const cyhal_adc_config_t *config);

/** Changes the current operating power level of the ADC.
 *
 * If the power level is set to @ref CYHAL_POWER_LEVEL_OFF, the ADC will be powered-off
 * but it will retain its configuration, so it is not necessary to reconfigure it when changing
 * the power level from @ref CYHAL_POWER_LEVEL_OFF to any other value.
 *
 * @param[in] obj   ADC object
 * @param[in] power The power level to set
 * @return The status of the set power request
 * On failure, a problem specific error code will be returned.
 * This error could be from the HAL or lower level driver.<br>
 * For all other return codes, please refer to device driver documentation available in the BSP landing page
 */
cy_rslt_t cyhal_adc_set_power(cyhal_adc_t *obj, cyhal_power_level_t power);

/** Configure the number of samples per second.
  *
  * This is the number of times each enabled channel is sampled per second. The total number of samples performed
  *  by the ADC hardware per second is equal to `sample_rate_hz / num_channels_enabled`.
  * Depending on the system clock configuration or limitations of the underlying hardware, it may not be possible
  *  to achieve precisely the desired sample rate. The `achived_sample_rate_hz` parameter will be updated to indicate
  *  the sample rate that was achived.
  * @note The `achieved_sample_rate_hz` value is only valid while the configuration of the ADC and its channels remains
  *  umodified. If @ref cyhal_adc_configure, @ref cyhal_adc_channel_init_diff, @ref cyhal_adc_channel_configure,
  *  or @ref cyhal_adc_channel_free is called, it is necessary to call this function again in order to update the sample rate.
  *  Therefore, it is recommended to call this function after the ADC and all channels have been configured.
  *
  * @param[in]  obj                      The ADC object to configure
  * @param[in]  desired_sample_rate_hz   The desired sample rate, in hertz
  * @param[out] achieved_sample_rate_hz  The achieved sample rate, in hertz
  *
  * @return The status of the sample rate request. Note that inability to exactly match the requested sample
  *  rate is not considered an error. It is the application's responsibility to determine whether the achived rate
  *  is within the tolerance that it requires.
  * \ref CY_RSLT_SUCCESS is returned on success.<br>
  * On failure, a problem specific error code will be returned. This error could be from the HAL or lower level driver.<br>
  * For all other return codes, please refer to device driver documentation available in the BSP landing page
  */
cy_rslt_t cyhal_adc_set_sample_rate(cyhal_adc_t* obj, uint32_t desired_sample_rate_hz, uint32_t* achieved_sample_rate_hz);

/** Initialize a differential ADC channel.
 * @note: Some platforms may restrict which pins can be used as part of a differential pair. See the
 * implementation-specific documentation for details.
 *
 * Configures the pin used by ADC.
 * @param[out] obj      The ADC channel object to initialize
 * @param[in]  adc      The ADC for which the channel should be initialized
 * @param[in]  vplus    Non-inverting input
 * @param[in]  vminus   Inverting input. For a single ended channel, use @ref CYHAL_ADC_VNEG.
 * @param[in]  cfg      The ADC channel configuration
 * @return The status of the init request.
 * On failure, a problem specific error code will be returned.
 * This error could be from the HAL or lower level driver.<br>
 * For all other return codes, please refer to device driver documentation available in the BSP landing page
 */
cy_rslt_t cyhal_adc_channel_init_diff(cyhal_adc_channel_t *obj, cyhal_adc_t* adc, cyhal_gpio_t vplus, cyhal_gpio_t vminus, const cyhal_adc_channel_config_t* cfg);

/** Update the ADC channel configuration.
  *
  * @note If a scan is in progress, this may cause it to be interrupted. It is not valid to change the enabled state
  *  of a channel while an asynchronous read operation is in progress.
  *
  * @param[in] obj      The ADC channel object
  * @param[in] config   The configuration to apply
  * @return The status of the configuration request
  * On failure, a problem specific error code will be returned.
  * This error could be from the HAL or lower level driver.<br>
  * For all other return codes, please refer to device driver documentation available in the BSP landing page
  */
cy_rslt_t cyhal_adc_channel_configure(cyhal_adc_channel_t *obj, const cyhal_adc_channel_config_t *config);

/** Uninitialize the ADC channel and cyhal_adc_channel_t object
 *
 * @param[in,out] obj The ADC channel object
 */
void cyhal_adc_channel_free(cyhal_adc_channel_t *obj);

/** Read the value from the ADC pin, represented as an unsigned 16bit value
 *  where 0x0000 represents the minimum value in the ADC's range, and 0xFFFF
 *  represents the maximum value in the ADC's range.
 * If continous scanning is disabled, this will block while a conversion is
 *   performed on the selected channel, then return the result. Depending on the
 *   ADC speed this function may block for some time.
 * If continuous scanning is enabled, this will return the value from the most
 *   recent conversion of the specified channel (if called shortly after enabling
 *   continuous scanning it may block until at least one conversion has been performed
 *   on this channel).
 *
 * @param[in] obj The ADC object
 * @return An unsigned 16bit value representing the current input voltage
 */
uint16_t cyhal_adc_read_u16(const cyhal_adc_channel_t *obj);

/** Read the value from ADC pin, represented as a 32-bit signed, right-aligned value.
 *
 * This is a 'resolution'-bit value, sign-extended to 32 bits. If the vplus signal is
 *  below the vminus signal, the result will be negative. If the vplus signal is above
 *  the vminus signal, the result will be positive.
 * If continous scanning is disabled, this will block while a conversion is
 *   performed on the selected channel, then return the result. Depending on the
 *   ADC speed this function may block for some time.
 * If continuous scanning is enabled, this will return the value from the most
 *   recent conversion of the specified channel (if called shortly after enabling
 *   continuous scanning it may block until at least one conversion has been performed
 *   on this channel).
 *
 * @param[in] obj The ADC object
 * @return A signed 32 bit value representing the current input voltage
 */
int32_t cyhal_adc_read(const cyhal_adc_channel_t *obj);

/** Read the value from ADC pin, in microvolts.
 *
 * If continous scanning is disabled, this will block while a conversion is
 *   performed on the selected channel, then return the result. Depending on the
 *   ADC speed this function may block for some time.
 * If continuous scanning is enabled, this will return the value from the most
 *   recent conversion of the specified channel (if called shortly after enabling
 *   continuous scanning it may block until at least one conversion has been performed
 *   on this channel).
 *
 * @param[in] obj The ADC object
 * @return An unsigned 32 bit value representing the current input in microvolts
 */
int32_t cyhal_adc_read_uv(const cyhal_adc_channel_t *obj);

/** Scan the specified ADC channels in the background and copy the results
  * into the array pointed to by `result_list`.
  *
  * Results are represented as 32-bit signed, right-aligned values. That is, they are
  *  'resolution'-bit values, sign-extended to 32 bits. If the vplus signal is
  *  below the vminus signal, the result will be negative. If the vplus signal is above
  *  the vminus signal, the result will be positive.
  *
  * If continuous scanning is disabled, this will trigger num_scan new scans and copy the results
  *  into `result_list` once the scan is completed.
  *
  * If continuous scanning is enabled, this will copy the results of num_scan scans into the result_list as
  *  they complete, beginning with the most recently completed scan (if one exists).
  *
  * Scan results are placed sequentially into result_list. That is, result_list will contain all of the results from the
  * first scan, followed by all of the results from the second scan, etc.  If channels exist that are initialized but not
  * enabled, they will consume locations in result_list, but these values are undefined.
  *
  * When the requested number of scans have been completed, the @ref CYHAL_ADC_ASYNC_READ_COMPLETE event will be raised.
  *
  * @ref cyhal_adc_set_async_mode can be used to control whether this uses DMA or a SW (CPU-driven) transfer.
  *
  * @param[in] obj          ADC to read from
  * @param[in] num_scan     The number of scans of each channel that should be read
  * @param[in] result_list  The array where results should be. This must be of length num_scan * initialized_channels,
  *                         where initialized_channels is the number of channels that have been initialized for this ADC
  *                         (and not later freed) via @ref cyhal_adc_channel_init_diff
  * @return The status of the read async request
  * On failure, a problem specific error code will be returned.
  * This error could be from the HAL or lower level driver.<br>
  * For all other return codes, please refer to device driver documentation available in the BSP landing page
  */
cy_rslt_t cyhal_adc_read_async(cyhal_adc_t* obj, size_t num_scan, int32_t* result_list);

/** Scan the specified ADC channels in the background and copy the conversion results in microvolts
  * into the array pointed to by `result_list`.
  *
  * If continuous scanning is disabled, this will trigger num_scan new scans and copy the results
  *  into `result_list` once the scan is completed.
  *
  * If continuous scanning is enabled, this will copy the results of num_scan scans into the result_list as
  *  they complete, beginning with the most recently completed scan (if one exists).
  *
  * Scan results are placed sequentially into result_list. That is, result_list will contain all of the results from the
  * first scan, followed by all of the results from the second scan, etc.  If channels exist that are initialized but not
  * enabled, they will consume locations in result_list, but these values are undefined.
  *
  * When the requested number of scans have been completed, the @ref CYHAL_ADC_ASYNC_READ_COMPLETE event will be raised.
  *
  * @ref cyhal_adc_set_async_mode can be used to control whether this uses DMA or a SW (CPU-driven) transfer.
  *
  * @param[in] obj          ADC to read from
  * @param[in] num_scan     The number of scans of each channel that should be read
  * @param[in] result_list  The array where results should be. This must be of length num_scan * initialized_channels,
  *                         where initialized_channels is the number of channels that have been initialized for this ADC
  *                         (and not later freed) via @ref cyhal_adc_channel_init_diff
  * @return The status of the read async request
  * On failure, a problem specific error code will be returned.
  * This error could be from the HAL or lower level driver.<br>
  * For all other return codes, please refer to device driver documentation available in the BSP landing page
  */
cy_rslt_t cyhal_adc_read_async_uv(cyhal_adc_t* obj, size_t num_scan, int32_t* result_list);

/** Set the mechanism that is used to perform ADC asynchronous transfers. The default is SW.
 *  @warning The effect of calling this function while an async transfer is pending is undefined.
 *
 * @param[in]     obj          The ADC object
 * @param[in]     mode         The transfer mode
 * @param[in]     dma_priority The priority, if DMA is used. Valid values are the same as for @ref cyhal_dma_init.
 *                             If DMA is not selected, the only valid value is CYHAL_DMA_PRIORITY_DEFAULT, and no
                               guarantees are made about prioritization.
 * @return The status of the set mode request
 * On failure, a problem specific error code will be returned.
 * This error could be from the HAL or lower level driver.<br>
 * For all other return codes, please refer to device driver documentation available in the BSP landing page
 */
cy_rslt_t cyhal_adc_set_async_mode(cyhal_adc_t *obj, cyhal_async_mode_t mode, uint8_t dma_priority);

