RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include/cyhal_adc.h
/** Register an ADC callback handler
 *
 * This function will be called when one of the events enabled by \ref cyhal_adc_enable_event occurs.
 *
 * @param[in] obj          The ADC object
 * @param[in] callback     The callback handler which will be invoked when the interrupt fires
 * @param[in] callback_arg Generic argument that will be provided to the callback when called
 */
void cyhal_adc_register_callback(cyhal_adc_t *obj, cyhal_adc_event_callback_t callback, void *callback_arg);

/** Configure ADC events.
 *
 * When an enabled event occurs, the function specified by \ref cyhal_adc_register_callback will be called.
 *
 * @param[in] obj            The ADC object
 * @param[in] event          The ADC event type
 * @param[in] intr_priority  The priority for NVIC interrupt events
 * @param[in] enable         True to turn on specified events, False to turn off
 */
void cyhal_adc_enable_event(cyhal_adc_t *obj, cyhal_adc_event_t event, uint8_t intr_priority, bool enable);

/** Connects a source signal and enables the specified input
 *
 * @param[in] obj          The ADC object
 * @param[in] source       Source signal obtained from another driver's cyhal_<PERIPH>_enable_output
 * @param[in] input        Which input signal to connect to
  * @return The status of the connection
 */
cy_rslt_t cyhal_adc_connect_digital(cyhal_adc_t *obj, cyhal_source_t source, cyhal_adc_input_t input);

/** Enables the specified output signal
 *
 * @param[in]  obj          The ADC object
 * @param[in]  output       Which output signal to enable
 * @param[out] source       Pointer to user-allocated source signal object
 * which will be initialized by enable_output. \p source should be passed to
 * (dis)connect_digital functions to (dis)connect the associated endpoints.
  * @return The status of the output enable
 */
cy_rslt_t cyhal_adc_enable_output(cyhal_adc_t *obj, cyhal_adc_output_t output, cyhal_source_t *source);

/** Disconnect a source signal and disable ADC input
 *
 * @param[in] obj          The ADC object
 * @param[in] source       Source signal from cyhal_<PERIPH>_enable_output to disable
 * @param[in] input        Which input signal to disconnect
  * @return The status of the disconnect
 */
cy_rslt_t cyhal_adc_disconnect_digital(cyhal_adc_t *obj, cyhal_source_t source, cyhal_adc_input_t input);

/** Disables specified output signal from ADC.
 *
 * @param[in]  obj          The ADC object
 * @param[in]  output       Which output signal to disable
  * @return The status of the disablement
 */
cy_rslt_t cyhal_adc_disable_output(cyhal_adc_t *obj, cyhal_adc_output_t output);

#if defined(__cplusplus)
}
#endif

#ifdef CYHAL_ADC_IMPL_HEADER
#include CYHAL_ADC_IMPL_HEADER
#endif /* CYHAL_ADC_IMPL_HEADER */

/** \} group_hal_adc */
